RIOT-OS/RIOT/cpu/StellarisWare/inc/lm4f130e5qr.h
//*****************************************************************************
//
// CAN registers (CAN0)
//
//*****************************************************************************
#define CAN0_CTL_R              (*((volatile unsigned long *)0x40040000))
#define CAN0_STS_R              (*((volatile unsigned long *)0x40040004))
#define CAN0_ERR_R              (*((volatile unsigned long *)0x40040008))
#define CAN0_BIT_R              (*((volatile unsigned long *)0x4004000C))
#define CAN0_INT_R              (*((volatile unsigned long *)0x40040010))
#define CAN0_TST_R              (*((volatile unsigned long *)0x40040014))
#define CAN0_BRPE_R             (*((volatile unsigned long *)0x40040018))
#define CAN0_IF1CRQ_R           (*((volatile unsigned long *)0x40040020))
#define CAN0_IF1CMSK_R          (*((volatile unsigned long *)0x40040024))
#define CAN0_IF1MSK1_R          (*((volatile unsigned long *)0x40040028))
#define CAN0_IF1MSK2_R          (*((volatile unsigned long *)0x4004002C))
#define CAN0_IF1ARB1_R          (*((volatile unsigned long *)0x40040030))
#define CAN0_IF1ARB2_R          (*((volatile unsigned long *)0x40040034))
#define CAN0_IF1MCTL_R          (*((volatile unsigned long *)0x40040038))
#define CAN0_IF1DA1_R           (*((volatile unsigned long *)0x4004003C))
#define CAN0_IF1DA2_R           (*((volatile unsigned long *)0x40040040))
#define CAN0_IF1DB1_R           (*((volatile unsigned long *)0x40040044))
#define CAN0_IF1DB2_R           (*((volatile unsigned long *)0x40040048))
#define CAN0_IF2CRQ_R           (*((volatile unsigned long *)0x40040080))
#define CAN0_IF2CMSK_R          (*((volatile unsigned long *)0x40040084))
#define CAN0_IF2MSK1_R          (*((volatile unsigned long *)0x40040088))
#define CAN0_IF2MSK2_R          (*((volatile unsigned long *)0x4004008C))
#define CAN0_IF2ARB1_R          (*((volatile unsigned long *)0x40040090))
#define CAN0_IF2ARB2_R          (*((volatile unsigned long *)0x40040094))
#define CAN0_IF2MCTL_R          (*((volatile unsigned long *)0x40040098))
#define CAN0_IF2DA1_R           (*((volatile unsigned long *)0x4004009C))
#define CAN0_IF2DA2_R           (*((volatile unsigned long *)0x400400A0))
#define CAN0_IF2DB1_R           (*((volatile unsigned long *)0x400400A4))
#define CAN0_IF2DB2_R           (*((volatile unsigned long *)0x400400A8))
#define CAN0_TXRQ1_R            (*((volatile unsigned long *)0x40040100))
#define CAN0_TXRQ2_R            (*((volatile unsigned long *)0x40040104))
#define CAN0_NWDA1_R            (*((volatile unsigned long *)0x40040120))
#define CAN0_NWDA2_R            (*((volatile unsigned long *)0x40040124))
#define CAN0_MSG1INT_R          (*((volatile unsigned long *)0x40040140))
#define CAN0_MSG2INT_R          (*((volatile unsigned long *)0x40040144))
#define CAN0_MSG1VAL_R          (*((volatile unsigned long *)0x40040160))
#define CAN0_MSG2VAL_R          (*((volatile unsigned long *)0x40040164))

//*****************************************************************************
//
// Timer registers (WTIMER2)
//
//*****************************************************************************
#define WTIMER2_CFG_R           (*((volatile unsigned long *)0x4004C000))
#define WTIMER2_TAMR_R          (*((volatile unsigned long *)0x4004C004))
#define WTIMER2_TBMR_R          (*((volatile unsigned long *)0x4004C008))
#define WTIMER2_CTL_R           (*((volatile unsigned long *)0x4004C00C))
#define WTIMER2_SYNC_R          (*((volatile unsigned long *)0x4004C010))
#define WTIMER2_IMR_R           (*((volatile unsigned long *)0x4004C018))
#define WTIMER2_RIS_R           (*((volatile unsigned long *)0x4004C01C))
#define WTIMER2_MIS_R           (*((volatile unsigned long *)0x4004C020))
#define WTIMER2_ICR_R           (*((volatile unsigned long *)0x4004C024))
#define WTIMER2_TAILR_R         (*((volatile unsigned long *)0x4004C028))
#define WTIMER2_TBILR_R         (*((volatile unsigned long *)0x4004C02C))
#define WTIMER2_TAMATCHR_R      (*((volatile unsigned long *)0x4004C030))
#define WTIMER2_TBMATCHR_R      (*((volatile unsigned long *)0x4004C034))
#define WTIMER2_TAPR_R          (*((volatile unsigned long *)0x4004C038))
#define WTIMER2_TBPR_R          (*((volatile unsigned long *)0x4004C03C))
#define WTIMER2_TAPMR_R         (*((volatile unsigned long *)0x4004C040))
#define WTIMER2_TBPMR_R         (*((volatile unsigned long *)0x4004C044))
#define WTIMER2_TAR_R           (*((volatile unsigned long *)0x4004C048))
#define WTIMER2_TBR_R           (*((volatile unsigned long *)0x4004C04C))
#define WTIMER2_TAV_R           (*((volatile unsigned long *)0x4004C050))
#define WTIMER2_TBV_R           (*((volatile unsigned long *)0x4004C054))
#define WTIMER2_RTCPD_R         (*((volatile unsigned long *)0x4004C058))
#define WTIMER2_TAPS_R          (*((volatile unsigned long *)0x4004C05C))
#define WTIMER2_TBPS_R          (*((volatile unsigned long *)0x4004C060))
#define WTIMER2_TAPV_R          (*((volatile unsigned long *)0x4004C064))
#define WTIMER2_TBPV_R          (*((volatile unsigned long *)0x4004C068))
#define WTIMER2_PP_R            (*((volatile unsigned long *)0x4004CFC0))

//*****************************************************************************
//
// Timer registers (WTIMER3)
//
//*****************************************************************************
#define WTIMER3_CFG_R           (*((volatile unsigned long *)0x4004D000))
#define WTIMER3_TAMR_R          (*((volatile unsigned long *)0x4004D004))
#define WTIMER3_TBMR_R          (*((volatile unsigned long *)0x4004D008))
#define WTIMER3_CTL_R           (*((volatile unsigned long *)0x4004D00C))
#define WTIMER3_SYNC_R          (*((volatile unsigned long *)0x4004D010))
#define WTIMER3_IMR_R           (*((volatile unsigned long *)0x4004D018))
#define WTIMER3_RIS_R           (*((volatile unsigned long *)0x4004D01C))
#define WTIMER3_MIS_R           (*((volatile unsigned long *)0x4004D020))
#define WTIMER3_ICR_R           (*((volatile unsigned long *)0x4004D024))
#define WTIMER3_TAILR_R         (*((volatile unsigned long *)0x4004D028))
#define WTIMER3_TBILR_R         (*((volatile unsigned long *)0x4004D02C))
#define WTIMER3_TAMATCHR_R      (*((volatile unsigned long *)0x4004D030))
#define WTIMER3_TBMATCHR_R      (*((volatile unsigned long *)0x4004D034))
#define WTIMER3_TAPR_R          (*((volatile unsigned long *)0x4004D038))
#define WTIMER3_TBPR_R          (*((volatile unsigned long *)0x4004D03C))
#define WTIMER3_TAPMR_R         (*((volatile unsigned long *)0x4004D040))
#define WTIMER3_TBPMR_R         (*((volatile unsigned long *)0x4004D044))
#define WTIMER3_TAR_R           (*((volatile unsigned long *)0x4004D048))
#define WTIMER3_TBR_R           (*((volatile unsigned long *)0x4004D04C))
#define WTIMER3_TAV_R           (*((volatile unsigned long *)0x4004D050))
#define WTIMER3_TBV_R           (*((volatile unsigned long *)0x4004D054))
#define WTIMER3_RTCPD_R         (*((volatile unsigned long *)0x4004D058))
#define WTIMER3_TAPS_R          (*((volatile unsigned long *)0x4004D05C))
#define WTIMER3_TBPS_R          (*((volatile unsigned long *)0x4004D060))
#define WTIMER3_TAPV_R          (*((volatile unsigned long *)0x4004D064))
#define WTIMER3_TBPV_R          (*((volatile unsigned long *)0x4004D068))
#define WTIMER3_PP_R            (*((volatile unsigned long *)0x4004DFC0))

//*****************************************************************************
//
// Timer registers (WTIMER4)
//
//*****************************************************************************
#define WTIMER4_CFG_R           (*((volatile unsigned long *)0x4004E000))
#define WTIMER4_TAMR_R          (*((volatile unsigned long *)0x4004E004))
#define WTIMER4_TBMR_R          (*((volatile unsigned long *)0x4004E008))
#define WTIMER4_CTL_R           (*((volatile unsigned long *)0x4004E00C))
#define WTIMER4_SYNC_R          (*((volatile unsigned long *)0x4004E010))
#define WTIMER4_IMR_R           (*((volatile unsigned long *)0x4004E018))
#define WTIMER4_RIS_R           (*((volatile unsigned long *)0x4004E01C))
#define WTIMER4_MIS_R           (*((volatile unsigned long *)0x4004E020))
#define WTIMER4_ICR_R           (*((volatile unsigned long *)0x4004E024))
#define WTIMER4_TAILR_R         (*((volatile unsigned long *)0x4004E028))
#define WTIMER4_TBILR_R         (*((volatile unsigned long *)0x4004E02C))
#define WTIMER4_TAMATCHR_R      (*((volatile unsigned long *)0x4004E030))
#define WTIMER4_TBMATCHR_R      (*((volatile unsigned long *)0x4004E034))
#define WTIMER4_TAPR_R          (*((volatile unsigned long *)0x4004E038))
#define WTIMER4_TBPR_R          (*((volatile unsigned long *)0x4004E03C))
#define WTIMER4_TAPMR_R         (*((volatile unsigned long *)0x4004E040))
#define WTIMER4_TBPMR_R         (*((volatile unsigned long *)0x4004E044))
#define WTIMER4_TAR_R           (*((volatile unsigned long *)0x4004E048))
#define WTIMER4_TBR_R           (*((volatile unsigned long *)0x4004E04C))
#define WTIMER4_TAV_R           (*((volatile unsigned long *)0x4004E050))
#define WTIMER4_TBV_R           (*((volatile unsigned long *)0x4004E054))
#define WTIMER4_RTCPD_R         (*((volatile unsigned long *)0x4004E058))
#define WTIMER4_TAPS_R          (*((volatile unsigned long *)0x4004E05C))
#define WTIMER4_TBPS_R          (*((volatile unsigned long *)0x4004E060))
#define WTIMER4_TAPV_R          (*((volatile unsigned long *)0x4004E064))
#define WTIMER4_TBPV_R          (*((volatile unsigned long *)0x4004E068))
#define WTIMER4_PP_R            (*((volatile unsigned long *)0x4004EFC0))

//*****************************************************************************
//
// Timer registers (WTIMER5)
//
//*****************************************************************************
#define WTIMER5_CFG_R           (*((volatile unsigned long *)0x4004F000))
#define WTIMER5_TAMR_R          (*((volatile unsigned long *)0x4004F004))
#define WTIMER5_TBMR_R          (*((volatile unsigned long *)0x4004F008))
#define WTIMER5_CTL_R           (*((volatile unsigned long *)0x4004F00C))
#define WTIMER5_SYNC_R          (*((volatile unsigned long *)0x4004F010))
#define WTIMER5_IMR_R           (*((volatile unsigned long *)0x4004F018))
#define WTIMER5_RIS_R           (*((volatile unsigned long *)0x4004F01C))
#define WTIMER5_MIS_R           (*((volatile unsigned long *)0x4004F020))
#define WTIMER5_ICR_R           (*((volatile unsigned long *)0x4004F024))
#define WTIMER5_TAILR_R         (*((volatile unsigned long *)0x4004F028))
#define WTIMER5_TBILR_R         (*((volatile unsigned long *)0x4004F02C))
#define WTIMER5_TAMATCHR_R      (*((volatile unsigned long *)0x4004F030))
#define WTIMER5_TBMATCHR_R      (*((volatile unsigned long *)0x4004F034))
#define WTIMER5_TAPR_R          (*((volatile unsigned long *)0x4004F038))
#define WTIMER5_TBPR_R          (*((volatile unsigned long *)0x4004F03C))
#define WTIMER5_TAPMR_R         (*((volatile unsigned long *)0x4004F040))
#define WTIMER5_TBPMR_R         (*((volatile unsigned long *)0x4004F044))
#define WTIMER5_TAR_R           (*((volatile unsigned long *)0x4004F048))
#define WTIMER5_TBR_R           (*((volatile unsigned long *)0x4004F04C))
#define WTIMER5_TAV_R           (*((volatile unsigned long *)0x4004F050))
#define WTIMER5_TBV_R           (*((volatile unsigned long *)0x4004F054))
#define WTIMER5_RTCPD_R         (*((volatile unsigned long *)0x4004F058))
#define WTIMER5_TAPS_R          (*((volatile unsigned long *)0x4004F05C))
#define WTIMER5_TBPS_R          (*((volatile unsigned long *)0x4004F060))
#define WTIMER5_TAPV_R          (*((volatile unsigned long *)0x4004F064))
#define WTIMER5_TBPV_R          (*((volatile unsigned long *)0x4004F068))
#define WTIMER5_PP_R            (*((volatile unsigned long *)0x4004FFC0))

